export default function DetailsSection() {
  return (
    <section className='flex flex-col items-center mb-12'>
      <h2 className='mb-8 text-3xl font-bold text-center text-primary'>
        שמי אביטל גולן שפר
        נשואה, אמא
        <span className='block'>סטודנטית לתואר ראשון בעבודה סוציאלית מרצה להעצמה דרך סיפור חיים</span>
      </h2>

      <p className='space-y-4 text-center text-gray-700'>
        <span className='block'>בעברי הייתי אישה מוכה והחלטתי לשתף את סיפור חיי - כאישה בסיכון שעברה חיים קשים ומסובכים וזאת על מנת להוות השראה ולהעצים אנשים בתהליכי משבר או בפרשת דרכים בחייהם.</span>
        <span className='block'>דרך ההרצאות שלי, אני מעניקה תקווה לאנשים שאיבדו אותה ומציגה להם דרך חדשה ואור בקצה המנהרה.</span>
        <span className='block'>בהתבסס על ניסיון חיי ועל כוחי, יחד עם הרקע האישי שלי, אני מובילה את הקהל למציאת כוחם הפנימי, להתגברות על אתגרים בחיים ומציעה נקודת מבט אחרת ומעוררת השראה לשיפור איכות החיים האישית והחברתית של אלה שסובלים / סבלו ונמצאים במצוקה.</span>
        <span className='block'>לאורך המפגש, אני יוצרת קשר אמפטי ואישי עם הקהל וזאת דרך השקפתי האופטימית והמרגשת על החיים בכדי ליצור מודעות ולהוביל לשינוי חיובי בכל תחומי חייהם.</span>
      </p>
    </section>
  );
}